In [179]:
import numpy as np
import pandas as pd

In [180]:
matches = pd.read_csv('matches.csv')
matches = matches[matches['season'] == 2016]
newdata = pd.read_csv('deliveries.csv')
ballbyball = matches.merge(newdata,left_on = 'id',right_on = 'match_id')
vk = ballbyball[ballbyball['batsman'] == 'V Kohli'][['id','season','batsman','batsman_runs']]
vk = vk.groupby('id')['batsman_runs'].sum().reset_index()
vk = vk.merge(matches,on = 'id')[['venue','team1','team2','winner','player_of_match','batsman_runs','season']]
vk

,venue,team1,team2,winner,player_of_match,batsman_runs,season
0,M Chinnaswamy Stadium,Royal Challengers Bangalore,Sunrisers Hyderabad,Royal Challengers Bangalore,AB de Villiers,75,2016
1,M Chinnaswamy Stadium,Royal Challengers Bangalore,Delhi Daredevils,Delhi Daredevils,Q de Kock,79,2016
2,Wankhede Stadium,Royal Challengers Bangalore,Mumbai Indians,Mumbai Indians,RG Sharma,33,2016
3,Maharashtra Cricket Association Stadium,Royal Challengers Bangalore,Rising Pune Supergiants,Royal Challengers Bangalore,AB de Villiers,80,2016
4,Saurashtra Cricket Association Stadium,Royal Challengers Bangalore,Gujarat Lions,Gujarat Lions,V Kohli,100,2016
5,"Rajiv Gandhi International Stadium, Uppal",Sunrisers Hyderabad,Royal Challengers Bangalore,Sunrisers Hyderabad,DA Warner,14,2016
6,M Chinnaswamy Stadium,Royal Challengers Bangalore,Kolkata Knight Riders,Kolkata Knight Riders,AD Russell,52,2016
7,M Chinnaswamy Stadium,Rising Pune Supergiants,Royal Challengers Bangalore,Royal Challengers Bangalore,V Kohli,108,2016
8,"Punjab Cricket Association IS Bindra Stadium, ...",Royal Challengers Bangalore,Kings XI Punjab,Royal Challengers Bangalore,SR Watson,20,2016
9,M Chinnaswamy Stadium,Royal Challengers Bangalore,Mumbai Indians,Mumbai Indians,KH Pandya,7,2016
10,M Chinnaswamy Stadium,Royal Challengers Bangalore,Gujarat Lions,Royal Challengers Bangalore,AB de Villiers,109,2016
11,Eden Gardens,Kolkata Knight Riders,Royal Challengers Bangalore,Royal Challengers Bangalore,V Kohli,75,2016
12,M Chinnaswamy Stadium,Royal Challengers Bangalore,Kings XI Punjab,Royal Challengers Bangalore,V Kohli,113,2016
13,Shaheed Veer Narayan Singh International Stadium,Delhi Daredevils,Royal Challengers Bangalore,Royal Challengers Bangalore,V Kohli,54,2016
14,M Chinnaswamy Stadium,Gujarat Lions,Royal Challengers Bangalore,Royal Challengers Bangalore,AB de Villiers,0,2016
15,M Chinnaswamy Stadium,Sunrisers Hyderabad,Royal Challengers Bangalore,Sunrisers Hyderabad,BCJ Cutting,54,2016

In [181]:
vk['winner'].value_counts()

winner
Royal Challengers Bangalore    9
Mumbai Indians                 2
Sunrisers Hyderabad            2
Delhi Daredevils               1
Gujarat Lions                  1
Kolkata Knight Riders          1
Name: count, dtype: int64

In [182]:
vk['player_of_match'].value_counts()

player_of_match
V Kohli           5
AB de Villiers    4
Q de Kock         1
RG Sharma         1
DA Warner         1
AD Russell        1
SR Watson         1
KH Pandya         1
BCJ Cutting       1
Name: count, dtype: int64

In [183]:
##Multi index series
multiindex = pd.MultiIndex.from_product([['cse','ece'],[2019,2020,2021,2022]])
multiindex

MultiIndex([('cse', 2019),
            ('cse', 2020),
            ('cse', 2021),
            ('cse', 2022),
            ('ece', 2019),
            ('ece', 2020),
            ('ece', 2021),
            ('ece', 2022)],
           )

In [184]:
s = pd.Series([1,2,3,4,5,6,7,8],index = multiindex)
s

cse  2019    1
     2020    2
     2021    3
     2022    4
ece  2019    5
     2020    6
     2021    7
     2022    8
dtype: int64

In [185]:
s['cse']

2019    1
2020    2
2021    3
2022    4
dtype: int64

In [186]:
temp = s.unstack()
temp

     2019  2020  2021  2022
cse     1     2     3     4
ece     5     6     7     8

In [187]:
temp.stack()

cse  2019    1
     2020    2
     2021    3
     2022    4
ece  2019    5
     2020    6
     2021    7
     2022    8
dtype: int64

In [188]:
s.reset_index()

  level_0  level_1  0
0     cse     2019  1
1     cse     2020  2
2     cse     2021  3
3     cse     2022  4
4     ece     2019  5
5     ece     2020  6
6     ece     2021  7
7     ece     2022  8

In [189]:
d3 = pd.DataFrame([
    [1,2,3,4],
    [5,6,7,8],
    [9,10,11,12],
    [23,23,12,12],
    [9,10,11,12],
    [23,23,12,12],
    [23,43,5,6],
    [23,43,5,6]
],
index = multiindex,
columns = pd.MultiIndex.from_product([['dehli','mumbai'],['avg_package','students']]))

d3

               dehli               mumbai
         avg_package students avg_package students
cse 2019           1        2           3        4
    2020           5        6           7        8
    2021           9       10          11       12
    2022          23       23          12       12
ece 2019           9       10          11       12
    2020          23       23          12       12
    2021          23       43           5        6
    2022          23       43           5        6

In [190]:
d3['dehli']['avg_package']

cse  2019     1
     2020     5
     2021     9
     2022    23
ece  2019     9
     2020    23
     2021    23
     2022    23
Name: avg_package, dtype: int64

In [191]:
d3.unstack().unstack()

dehli   avg_package  2019  cse     1
                           ece     9
                     2020  cse     5
                           ece    23
                     2021  cse     9
                           ece    23
                     2022  cse    23
                           ece    23
        students     2019  cse     2
                           ece    10
                     2020  cse     6
                           ece    23
                     2021  cse    10
                           ece    43
                     2022  cse    23
                           ece    43
mumbai  avg_package  2019  cse     3
                           ece    11
                     2020  cse     7
                           ece    12
                     2021  cse    11
                           ece     5
                     2022  cse    12
                           ece     5
        students     2019  cse     4
                           ece    12
                     2020  cse     8
                           ece    12
                     2021  cse    12
                           ece     6
                     2022  cse    12
                           ece     6
dtype: int64

In [192]:
d3.stack().stack()

/var/folders/4j/n0rl6b3s0657t_7z21qxxz6w0000gn/T/ipykernel_70080/3196539118.py:1: FutureWarning: The previous implementation of stack is deprecated and will be removed in a future version of pandas. See the What's New notes for pandas 2.1.0 for details. Specify future_stack=True to adopt the new implementation and silence this warning.
  d3.stack().stack()

cse  2019  avg_package  dehli      1
                        mumbai     3
           students     dehli      2
                        mumbai     4
     2020  avg_package  dehli      5
                        mumbai     7
           students     dehli      6
                        mumbai     8
     2021  avg_package  dehli      9
                        mumbai    11
           students     dehli     10
                        mumbai    12
     2022  avg_package  dehli     23
                        mumbai    12
           students     dehli     23
                        mumbai    12
ece  2019  avg_package  dehli      9
                        mumbai    11
           students     dehli     10
                        mumbai    12
     2020  avg_package  dehli     23
                        mumbai    12
           students     dehli     23
                        mumbai    12
     2021  avg_package  dehli     23
                        mumbai     5
           students     dehli     43
                        mumbai     6
     2022  avg_package  dehli     23
                        mumbai     5
           students     dehli     43
                        mumbai     6
dtype: int64

In [193]:
d3.head()

               dehli               mumbai
         avg_package students avg_package students
cse 2019           1        2           3        4
    2020           5        6           7        8
    2021           9       10          11       12
    2022          23       23          12       12
ece 2019           9       10          11       12

In [194]:
d3.shape

(8, 4)

In [195]:
d3.unstack().info()

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, cse to ece
Data columns (total 16 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   (dehli, avg_package, 2019)   2 non-null      int64
 1   (dehli, avg_package, 2020)   2 non-null      int64
 2   (dehli, avg_package, 2021)   2 non-null      int64
 3   (dehli, avg_package, 2022)   2 non-null      int64
 4   (dehli, students, 2019)      2 non-null      int64
 5   (dehli, students, 2020)      2 non-null      int64
 6   (dehli, students, 2021)      2 non-null      int64
 7   (dehli, students, 2022)      2 non-null      int64
 8   (mumbai, avg_package, 2019)  2 non-null      int64
 9   (mumbai, avg_package, 2020)  2 non-null      int64
 10  (mumbai, avg_package, 2021)  2 non-null      int64
 11  (mumbai, avg_package, 2022)  2 non-null      int64
 12  (mumbai, students, 2019)     2 non-null      int64
 13  (mumbai, students, 2020)     2 non-null      int64
 14  (mumbai, students, 2021)     2 non-null      int64
 15  (mumbai, students, 2022)     2 non-null      int64
dtypes: int64(16)
memory usage: 272.0+ bytes

In [196]:
d3.duplicated()

cse  2019    False
     2020    False
     2021    False
     2022    False
ece  2019     True
     2020     True
     2021    False
     2022     True
dtype: bool

In [197]:
confirm = pd.read_csv('time_series_covid19_confirmed_global.csv')
death = pd.read_csv('time_series_covid19_deaths_global.csv')

In [198]:
confirm

,Province/State,Country/Region,Lat,Long,1/22/20,1/23/20,1/24/20,1/25/20,1/26/20,1/27/20,...,12/24/22,12/25/22,12/26/22,12/27/22,12/28/22,12/29/22,12/30/22,12/31/22,1/1/23,1/2/23
0,NaN,Afghanistan,33.939110,67.709953,0,0,0,0,0,0,...,207310,207399,207438,207460,207493,207511,207550,207559,207616,207627
1,NaN,Albania,41.153300,20.168300,0,0,0,0,0,0,...,333749,333749,333751,333751,333776,333776,333806,333806,333811,333812
2,NaN,Algeria,28.033900,1.659600,0,0,0,0,0,0,...,271194,271198,271198,271202,271208,271217,271223,271228,271229,271229
3,NaN,Andorra,42.506300,1.521800,0,0,0,0,0,0,...,47686,47686,47686,47686,47751,47751,47751,47751,47751,47751
4,NaN,Angola,-11.202700,17.873900,0,0,0,0,0,0,...,104973,104973,104973,105095,105095,105095,105095,105095,105095,105095
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
284,NaN,West Bank and Gaza,31.952200,35.233200,0,0,0,0,0,0,...,703228,703228,703228,703228,703228,703228,703228,703228,703228,703228
285,NaN,Winter Olympics 2022,39.904200,116.407400,0,0,0,0,0,0,...,535,535,535,535,535,535,535,535,535,535
286,NaN,Yemen,15.552727,48.516388,0,0,0,0,0,0,...,11945,11945,11945,11945,11945,11945,11945,11945,11945,11945
287,NaN,Zambia,-13.133897,27.849332,0,0,0,0,0,0,...,334021,334021,334066,334108,334196,334294,334425,334425,334629,334661
288,NaN,Zimbabwe,-19.015438,29.154857,0,0,0,0,0,0,...,259981,259981,259981,259981,259981,259981,259981,259981,259981,259981

In [199]:
death

,Province/State,Country/Region,Lat,Long,1/22/20,1/23/20,1/24/20,1/25/20,1/26/20,1/27/20,...,12/24/22,12/25/22,12/26/22,12/27/22,12/28/22,12/29/22,12/30/22,12/31/22,1/1/23,1/2/23
0,NaN,Afghanistan,33.939110,67.709953,0,0,0,0,0,0,...,7845,7846,7846,7846,7846,7847,7847,7849,7849,7849
1,NaN,Albania,41.153300,20.168300,0,0,0,0,0,0,...,3595,3595,3595,3595,3595,3595,3595,3595,3595,3595
2,NaN,Algeria,28.033900,1.659600,0,0,0,0,0,0,...,6881,6881,6881,6881,6881,6881,6881,6881,6881,6881
3,NaN,Andorra,42.506300,1.521800,0,0,0,0,0,0,...,165,165,165,165,165,165,165,165,165,165
4,NaN,Angola,-11.202700,17.873900,0,0,0,0,0,0,...,1928,1928,1928,1930,1930,1930,1930,1930,1930,1930
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
284,NaN,West Bank and Gaza,31.952200,35.233200,0,0,0,0,0,0,...,5708,5708,5708,5708,5708,5708,5708,5708,5708,5708
285,NaN,Winter Olympics 2022,39.904200,116.407400,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
286,NaN,Yemen,15.552727,48.516388,0,0,0,0,0,0,...,2159,2159,2159,2159,2159,2159,2159,2159,2159,2159
287,NaN,Zambia,-13.133897,27.849332,0,0,0,0,0,0,...,4019,4019,4022,4022,4023,4023,4024,4024,4024,4024
288,NaN,Zimbabwe,-19.015438,29.154857,0,0,0,0,0,0,...,5637,5637,5637,5637,5637,5637,5637,5637,5637,5637

In [200]:
death = death.melt(id_vars = ['Province/State',	'Country/Region',	'Lat',	'Long'],var_name = "Date",value_name = "No_of_death")
confirm = confirm.melt(id_vars = ['Province/State',	'Country/Region',	'Lat',	'Long'],var_name = "Date",value_name = "No_of_confirm")

In [201]:
covid = confirm.merge(death, on=['Province/State','Country/Region','Lat','Long','Date'])

In [204]:
covid.sort_values('No_of_death' ,ascending = False)

,Province/State,Country/Region,Lat,Long,Date,No_of_confirm,No_of_death
311224,NaN,US,40.0000,-100.0000,1/2/23,100759251,1092679
310646,NaN,US,40.0000,-100.0000,12/31/22,100749731,1092674
310935,NaN,US,40.0000,-100.0000,1/1/23,100752629,1092674
310357,NaN,US,40.0000,-100.0000,12/30/22,100743442,1092661
310068,NaN,US,40.0000,-100.0000,12/29/22,100706571,1092456
...,...,...,...,...,...,...,...
105465,Falkland Islands (Malvinas),United Kingdom,-51.7963,-59.5236,1/20/21,35,0
105464,Channel Islands,United Kingdom,49.3723,-2.3644,1/20/21,0,0
105460,Anguilla,United Kingdom,18.2206,-63.0686,1/20/21,15,0
105455,NaN,Tuvalu,-7.1095,177.6493,1/20/21,0,0
155626,NaN,Holy See,41.9029,12.4534,7/13/21,27,0